## ✅ Terraform Plan SUCCESS

<details>
<summary>Click to expand plan output</summary>

```

> autonyan-cloud-functions@1.0.0 terraform:plan
> npm run build:function && terraform -chdir=terraform plan -lock-timeout=5m


> autonyan-cloud-functions@1.0.0 build:function
> ./scripts/build-function.sh

Copying shared utilities...
  - Copying shared utilities to text-firebase-writer...
  - Copying shared utilities to doc-processor...
  - Copying shared utilities to drive-scanner...
  - Copying shared utilities to text-vision-processor...
Building shared module...

> autonyan-shared@1.0.0 build
> tsc

Building TypeScript...

> autonyan-cloud-functions@1.0.0 build
> npm run build --workspaces


> doc-processor-function@1.0.0 build
> tsc


> drive-scanner-function@1.0.0 build
> tsc


> text-firebase-writer@1.0.0 build
> tsc


> text-vision-processor@1.0.0 build
> tsc


> autonyan-shared@1.0.0 build
> tsc

Preparing function packages...
  - Preparing text-firebase-writer function package...
  - Preparing doc-processor function package...
  - Preparing drive-scanner function package...
  - Preparing text-vision-processor function package...
Creating function zips...
  - Creating text-firebase-writer function zip...
  adding: index.ts (deflated 70%)
  adding: package.json (deflated 59%)
  adding: shared/ (stored 0%)
  adding: shared/index.ts (deflated 10%)
  adding: shared/parameter-parser.ts (deflated 71%)
  adding: tsconfig.json (deflated 42%)
  - Creating doc-processor function zip...
  adding: index.ts (deflated 67%)
  adding: package.json (deflated 57%)
  adding: shared/ (stored 0%)
  adding: shared/index.ts (deflated 10%)
  adding: shared/parameter-parser.ts (deflated 71%)
  adding: tsconfig.json (deflated 42%)
  - Creating drive-scanner function zip...
  adding: index.ts (deflated 64%)
  adding: package.json (deflated 59%)
  adding: shared/ (stored 0%)
  adding: shared/index.ts (deflated 10%)
  adding: shared/parameter-parser.ts (deflated 71%)
  adding: tsconfig.json (deflated 42%)
  - Creating text-vision-processor function zip...
  adding: index.ts (deflated 68%)
  adding: package.json (deflated 60%)
  adding: shared/ (stored 0%)
  adding: shared/index.ts (deflated 10%)
  adding: shared/parameter-parser.ts (deflated 71%)
  adding: tsconfig.json (deflated 41%)
Cleaning up shared utilities...
Build complete! Function zips created:
  - dist/functions/text-firebase-writer.zip
  - dist/functions/doc-processor.zip
  - dist/functions/drive-scanner.zip
  - dist/functions/text-vision-processor.zip
[0m[1mgoogle_project_service.pubsub_api: Refreshing state... [id=home-hack-388806/pubsub.googleapis.com][0m
[0m[1mmodule.doc_processor.google_pubsub_topic.doc_process_trigger: Refreshing state... [id=projects/home-hack-388806/topics/doc-process-trigger][0m
[0m[1mgoogle_project_service.drive_api: Refreshing state... [id=home-hack-388806/drive.googleapis.com][0m
[0m[1mgoogle_project_service.firestore_api: Refreshing state... [id=home-hack-388806/firestore.googleapis.com][0m
[0m[1mmodule.doc_processor.google_service_account.doc_processor_sa: Refreshing state... [id=projects/home-hack-388806/serviceAccounts/doc-processor-sa@home-hack-388806.iam.gserviceaccount.com][0m
[0m[1mmodule.drive_scanner.google_pubsub_topic.drive_scan_trigger: Refreshing state... [id=projects/home-hack-388806/topics/drive-scan-trigger][0m
[0m[1mmodule.text_firebase_writer.google_service_account.text_firebase_writer: Refreshing state... [id=projects/home-hack-388806/serviceAccounts/text-firebase-writer@home-hack-388806.iam.gserviceaccount.com][0m
[0m[1mmodule.drive_scanner.google_service_account.drive_scanner_sa: Refreshing state... [id=projects/home-hack-388806/serviceAccounts/drive-scanner-sa@home-hack-388806.iam.gserviceaccount.com][0m
[0m[1mgoogle_storage_bucket.document_storage: Refreshing state... [id=home-hack-388806-document-storage][0m
[0m[1mgoogle_storage_bucket.vision_results: Refreshing state... [id=home-hack-388806-vision-results][0m
[0m[1mgoogle_project_service.cloudfunctions_api: Refreshing state... [id=home-hack-388806/cloudfunctions.googleapis.com][0m
[0m[1mdata.google_storage_project_service_account.gcs_account: Reading...[0m[0m
[0m[1mmodule.text_vision_processor.google_service_account.text_vision_processor: Refreshing state... [id=projects/home-hack-388806/serviceAccounts/text-vision-processor@home-hack-388806.iam.gserviceaccount.com][0m
[0m[1mgoogle_project_service.vision_api: Refreshing state... [id=home-hack-388806/vision.googleapis.com][0m
[0m[1mgoogle_storage_bucket.function_bucket: Refreshing state... [id=home-hack-388806-function-source][0m
[0m[1mdata.google_storage_project_service_account.gcs_account: Read complete after 0s [id=service-740634168833@gs-project-accounts.iam.gserviceaccount.com][0m
[0m[1mmodule.drive_scanner.google_project_iam_member.pubsub_publisher: Refreshing state... [id=home-hack-388806/roles/pubsub.publisher/serviceAccount:drive-scanner-sa@home-hack-388806.iam.gserviceaccount.com][0m
[0m[1mmodule.drive_scanner.google_project_iam_member.service_usage: Refreshing state... [id=home-hack-388806/roles/serviceusage.serviceUsageConsumer/serviceAccount:drive-scanner-sa@home-hack-388806.iam.gserviceaccount.com][0m
[0m[1mmodule.drive_scanner.google_project_iam_member.storage_access: Refreshing state... [id=home-hack-388806/roles/storage.objectViewer/serviceAccount:drive-scanner-sa@home-hack-388806.iam.gserviceaccount.com][0m
[0m[1mmodule.doc_processor.google_project_iam_member.doc_processor_storage_access: Refreshing state... [id=home-hack-388806/roles/storage.objectAdmin/serviceAccount:doc-processor-sa@home-hack-388806.iam.gserviceaccount.com][0m
[0m[1mmodule.doc_processor.google_project_iam_member.doc_processor_service_usage: Refreshing state... [id=home-hack-388806/roles/serviceusage.serviceUsageConsumer/serviceAccount:doc-processor-sa@home-hack-388806.iam.gserviceaccount.com][0m
[0m[1mmodule.text_firebase_writer.google_project_iam_member.text_firebase_writer_firestore: Refreshing state... [id=home-hack-388806/roles/datastore.user/serviceAccount:text-firebase-writer@home-hack-388806.iam.gserviceaccount.com][0m
[0m[1mmodule.text_vision_processor.google_project_iam_member.text_vision_processor_vision: Refreshing state... [id=home-hack-388806/roles/ml.developer/serviceAccount:text-vision-processor@home-hack-388806.iam.gserviceaccount.com][0m
[0m[1mgoogle_cloud_scheduler_job.drive_scan_schedule: Refreshing state... [id=projects/home-hack-388806/locations/asia-northeast1/jobs/drive-scan-schedule][0m
[0m[1mgoogle_project_iam_member.gcs_pubsub_publisher: Refreshing state... [id=home-hack-388806/roles/pubsub.publisher/serviceAccount:service-740634168833@gs-project-accounts.iam.gserviceaccount.com][0m
[0m[1mmodule.text_firebase_writer.google_storage_bucket_iam_member.text_firebase_writer_vision_results: Refreshing state... [id=b/home-hack-388806-vision-results/roles/storage.objectViewer/serviceAccount:text-firebase-writer@home-hack-388806.iam.gserviceaccount.com][0m
[0m[1mmodule.text_vision_processor.google_storage_bucket_iam_member.text_vision_processor_vision_results: Refreshing state... [id=b/home-hack-388806-vision-results/roles/storage.objectAdmin/serviceAccount:text-vision-processor@home-hack-388806.iam.gserviceaccount.com][0m
[0m[1mmodule.drive_scanner.google_storage_bucket_object.drive_scanner_zip: Refreshing state... [id=home-hack-388806-function-source-drive-scanner.zip][0m
[0m[1mmodule.text_firebase_writer.google_storage_bucket_object.text_firebase_writer_zip: Refreshing state... [id=home-hack-388806-function-source-text-firebase-writer.zip][0m
[0m[1mmodule.doc_processor.google_storage_bucket_object.doc_processor_zip: Refreshing state... [id=home-hack-388806-function-source-doc-processor.zip][0m
[0m[1mmodule.text_vision_processor.google_storage_bucket_object.text_vision_processor_zip: Refreshing state... [id=home-hack-388806-function-source-text-vision-processor.zip][0m
[0m[1mmodule.text_firebase_writer.google_storage_bucket_iam_member.text_firebase_writer_document_storage: Refreshing state... [id=b/home-hack-388806-document-storage/roles/storage.objectViewer/serviceAccount:text-firebase-writer@home-hack-388806.iam.gserviceaccount.com][0m
[0m[1mmodule.text_vision_processor.google_storage_bucket_iam_member.text_vision_processor_document_storage: Refreshing state... [id=b/home-hack-388806-document-storage/roles/storage.objectViewer/serviceAccount:text-vision-processor@home-hack-388806.iam.gserviceaccount.com][0m
[0m[1mmodule.drive_scanner.google_cloudfunctions2_function.drive_scanner: Refreshing state... [id=projects/home-hack-388806/locations/asia-northeast1/functions/drive-scanner][0m
[0m[1mmodule.text_firebase_writer.google_cloudfunctions2_function.text_firebase_writer: Refreshing state... [id=projects/home-hack-388806/locations/asia-northeast1/functions/text-firebase-writer][0m
[0m[1mmodule.doc_processor.google_cloudfunctions2_function.doc_processor: Refreshing state... [id=projects/home-hack-388806/locations/asia-northeast1/functions/doc-processor][0m
[0m[1mmodule.text_vision_processor.google_cloudfunctions2_function.text_vision_processor: Refreshing state... [id=projects/home-hack-388806/locations/asia-northeast1/functions/text-vision-processor][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [33m~[0m update in-place[0m

Terraform will perform the following actions:

[1m  # module.doc_processor.google_cloudfunctions2_function.doc_processor[0m will be updated in-place
[0m  [33m~[0m[0m resource "google_cloudfunctions2_function" "doc_processor" {
        id               = "projects/home-hack-388806/locations/asia-northeast1/functions/doc-processor"
        name             = "doc-processor"
        [90m# (10 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m build_config {
            [90m# (6 unchanged attributes hidden)[0m[0m

          [33m~[0m[0m source {
              [33m~[0m[0m storage_source {
                  [33m~[0m[0m generation = 1764934985537567 -> (known after apply)
                    [90m# (2 unchanged attributes hidden)[0m[0m
                }
            }

            [90m# (1 unchanged block hidden)[0m[0m
        }

        [90m# (2 unchanged blocks hidden)[0m[0m
    }

[1m  # module.doc_processor.google_storage_bucket_object.doc_processor_zip[0m will be updated in-place
[0m  [33m~[0m[0m resource "google_storage_bucket_object" "doc_processor_zip" {
      [33m~[0m[0m crc32c           = "/MRS1Q==" -> (known after apply)
      [33m~[0m[0m detect_md5hash   = "myGgjBgIsM8xYdxK730DIQ==" [33m->[0m[0m "different hash"
      [33m~[0m[0m generation       = 1764934985537567 -> (known after apply)
        id               = "home-hack-388806-function-source-doc-processor.zip"
      [33m~[0m[0m md5hash          = "myGgjBgIsM8xYdxK730DIQ==" -> (known after apply)
        name             = "doc-processor.zip"
        [90m# (11 unchanged attributes hidden)[0m[0m
    }

[1m  # module.drive_scanner.google_cloudfunctions2_function.drive_scanner[0m will be updated in-place
[0m  [33m~[0m[0m resource "google_cloudfunctions2_function" "drive_scanner" {
        id               = "projects/home-hack-388806/locations/asia-northeast1/functions/drive-scanner"
        name             = "drive-scanner"
        [90m# (10 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m build_config {
            [90m# (6 unchanged attributes hidden)[0m[0m

          [33m~[0m[0m source {
              [33m~[0m[0m storage_source {
                  [33m~[0m[0m generation = 1764934985546994 -> (known after apply)
                    [90m# (2 unchanged attributes hidden)[0m[0m
                }
            }

            [90m# (1 unchanged block hidden)[0m[0m
        }

        [90m# (2 unchanged blocks hidden)[0m[0m
    }

[1m  # module.drive_scanner.google_storage_bucket_object.drive_scanner_zip[0m will be updated in-place
[0m  [33m~[0m[0m resource "google_storage_bucket_object" "drive_scanner_zip" {
      [33m~[0m[0m crc32c           = "XY69zQ==" -> (known after apply)
      [33m~[0m[0m detect_md5hash   = "dFjHRa/jNisjTaG7CXEqSQ==" [33m->[0m[0m "different hash"
      [33m~[0m[0m generation       = 1764934985546994 -> (known after apply)
        id               = "home-hack-388806-function-source-drive-scanner.zip"
      [33m~[0m[0m md5hash          = "dFjHRa/jNisjTaG7CXEqSQ==" -> (known after apply)
        name             = "drive-scanner.zip"
        [90m# (11 unchanged attributes hidden)[0m[0m
    }

[1m  # module.text_firebase_writer.google_cloudfunctions2_function.text_firebase_writer[0m will be updated in-place
[0m  [33m~[0m[0m resource "google_cloudfunctions2_function" "text_firebase_writer" {
        id               = "projects/home-hack-388806/locations/asia-northeast1/functions/text-firebase-writer"
        name             = "text-firebase-writer"
        [90m# (10 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m build_config {
            [90m# (6 unchanged attributes hidden)[0m[0m

          [33m~[0m[0m source {
              [33m~[0m[0m storage_source {
                  [33m~[0m[0m generation = 1764934985550738 -> (known after apply)
                    [90m# (2 unchanged attributes hidden)[0m[0m
                }
            }

            [90m# (1 unchanged block hidden)[0m[0m
        }

        [90m# (2 unchanged blocks hidden)[0m[0m
    }

[1m  # module.text_firebase_writer.google_storage_bucket_object.text_firebase_writer_zip[0m will be updated in-place
[0m  [33m~[0m[0m resource "google_storage_bucket_object" "text_firebase_writer_zip" {
      [33m~[0m[0m crc32c           = "x3YGiA==" -> (known after apply)
      [33m~[0m[0m detect_md5hash   = "g87BcnMxPe7WkjnsxdTTKw==" [33m->[0m[0m "different hash"
      [33m~[0m[0m generation       = 1764934985550738 -> (known after apply)
        id               = "home-hack-388806-function-source-text-firebase-writer.zip"
      [33m~[0m[0m md5hash          = "g87BcnMxPe7WkjnsxdTTKw==" -> (known after apply)
        name             = "text-firebase-writer.zip"
        [90m# (11 unchanged attributes hidden)[0m[0m
    }

[1m  # module.text_vision_processor.google_cloudfunctions2_function.text_vision_processor[0m will be updated in-place
[0m  [33m~[0m[0m resource "google_cloudfunctions2_function" "text_vision_processor" {
        id               = "projects/home-hack-388806/locations/asia-northeast1/functions/text-vision-processor"
        name             = "text-vision-processor"
        [90m# (10 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m build_config {
            [90m# (6 unchanged attributes hidden)[0m[0m

          [33m~[0m[0m source {
              [33m~[0m[0m storage_source {
                  [33m~[0m[0m generation = 1764934985539094 -> (known after apply)
                    [90m# (2 unchanged attributes hidden)[0m[0m
                }
            }

            [90m# (1 unchanged block hidden)[0m[0m
        }

        [90m# (2 unchanged blocks hidden)[0m[0m
    }

[1m  # module.text_vision_processor.google_storage_bucket_object.text_vision_processor_zip[0m will be updated in-place
[0m  [33m~[0m[0m resource "google_storage_bucket_object" "text_vision_processor_zip" {
      [33m~[0m[0m crc32c           = "qYUDdw==" -> (known after apply)
      [33m~[0m[0m detect_md5hash   = "50lKtNXlMfySooDNH25vMw==" [33m->[0m[0m "different hash"
      [33m~[0m[0m generation       = 1764934985539094 -> (known after apply)
        id               = "home-hack-388806-function-source-text-vision-processor.zip"
      [33m~[0m[0m md5hash          = "50lKtNXlMfySooDNH25vMw==" -> (known after apply)
        name             = "text-vision-processor.zip"
        [90m# (11 unchanged attributes hidden)[0m[0m
    }

[1mPlan:[0m 0 to add, 8 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>

*Auto-triggered after Test workflow success*